src/Catalogs/ar_Навыки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Навыки</Name>
			<Comment>Реестр переиспользуемых markdown-skills для агентов. META-23.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Содержимое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Обновлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_Навыки/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника ar_Навыки.
//
// Зона ответственности (META-23):
//   - автообновление ar_Обновлено при создании нового элемента или изменении ar_Содержимое;
//   - автозаполнение Наименования значением ar_Имя при пустом наименовании.
//
// Справочник - реестр переиспользуемых markdown-skills для агентов.
// Каждая запись хранит markdown-тело skill (ar_Содержимое) и метаданные
// (Имя, Описание, Категория, Версия, Автор).

#Область ОбработчикиСобытий

// Платформенный обработчик перед записью.
// Используется для автообновления ar_Обновлено и автозаполнения Наименования.
//
// Параметры:
//  Отказ - Булево - флаг отказа от записи.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Автозаполнение Наименования значением ar_Имя.
	Если ПустаяСтрока(Наименование) И ЗначениеЗаполнено(ar_Имя) Тогда
		Наименование = ar_Имя;
	КонецЕсли;

	// Автообновление ar_Обновлено при создании или изменении Содержимого.
	Если ЭтоНовый() Тогда
		// Новый элемент - устанавливаем текущую дату.
		ar_Обновлено = ТекущаяДатаСеанса();
	Иначе
		// Существующий элемент - проверяем, изменилось ли Содержимое.
		ОбъектБД = Ссылка.ПолучитьОбъект();
		Если ОбъектБД <> Неопределено И ОбъектБД.ar_Содержимое <> ar_Содержимое Тогда
			ar_Обновлено = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
